///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет массив процедур для тестирования для пользователя ИБ.
//
// Параметры:
//   Состав - Соответствие:
//     * Ключ - Строка - имя пользователя ИБ.
//     * Значение - Массив из Структура - массив процедур:
//       ** ИмяПроцедуры - Строка
//       ** ВыполнятьВОтдельнойКопииИБ - Булево
//       ** ВыполнятьВФайловойИБ - Булево
//       ** ВыполнятьВСервернойИБ - Булево
//       ** МаксимумМинутВыполнения - Число - максимальное время в минутах для выполнения процедуры
//
Процедура ЗаполнитьСоставПроцедур(Состав) Экспорт
	
	ЭтоВыходные = ДеньНедели(ТекущаяДатаСеанса()) > 5;
	Процедуры = Новый Массив;
	
	// В будни Файловая ИБ. В выходные Файловая ИБ + СУБД.
	ДобавитьПроцедуру(Процедуры, "ТиповыеОперацииСОбъектамиСРазнымиФункциональнымиОпциями", Истина,, ЭтоВыходные, 30); // Файловая ИБ.
	Состав.Вставить("Администратор", Процедуры);
	
	Процедуры = Новый Массив;
	ДобавитьПроцедуру(Процедуры, "ТиповыеОперацииСОбъектамиВМоделиСервиса", Истина,, Ложь, 20); // Файловая ИБ.
	Состав.Вставить("Администратор области", Процедуры);
	
	Процедуры = Новый Массив;
	ДобавитьПроцедуру(Процедуры, "ТиповыеОперацииСОбъектамиСРазнымиФункциональнымиОпциямиРуководитель", Истина,, Ложь, 25); // Файловая ИБ.
	Состав.Вставить("Руководитель", Процедуры);
	
	Процедуры = Новый Массив;
	ДобавитьПроцедуру(Процедуры, "ОткрытиеВсехФормДемобазыПоУмолчаниюМинимальныеПрава", Истина,, Ложь, 20); // Файловая ИБ.
	Состав.Вставить("Пользователь", Процедуры);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПроцедуру(Процедуры, ИмяПроцедуры, ВыполнятьВОтдельнойКопииИБ,
	ВыполнятьВФайловойИБ = Истина, ВыполнятьВСервернойИБ = Истина, МаксимумМинутВыполнения = 5)
	
	ОписаниеПроцедуры = Новый Структура;
	ОписаниеПроцедуры.Вставить("ИмяПроцедуры",               ИмяПроцедуры);
	ОписаниеПроцедуры.Вставить("ВыполнятьВОтдельнойКопииИБ", ВыполнятьВОтдельнойКопииИБ);
	ОписаниеПроцедуры.Вставить("ВыполнятьВФайловойИБ",       ВыполнятьВФайловойИБ);
	ОписаниеПроцедуры.Вставить("ВыполнятьВСервернойИБ",      ВыполнятьВСервернойИБ);
	ОписаниеПроцедуры.Вставить("МаксимумМинутВыполнения",    МаксимумМинутВыполнения);
	
	Процедуры.Добавить(ОписаниеПроцедуры);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'; en = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли